# Resolução do Case 
### Processo Seletivo Trybe: Vaga Lead Data Analyst

In [2]:
#Importando as bibliotecas necessárias para o desenvolvimento do carregamento, limpeza e análise ex-
# ploratória dos dados.
import pandas as pd
import matplotlib
import seaborn as sns

##### Importando e avaliando a importação de cada arquivo

In [3]:
stdinfo_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\studentInfo.csv')
stdinfo_df.head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass

In [4]:
stdassessment_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\studentAssessment.csv')
stdassessment_df.head()

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

In [5]:
assessments_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\assessments.csv')
assessments_df.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [6]:
courses_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\courses.csv')
courses_df.head()

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

In [7]:
stdregistration_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\studentRegistration.csv')
stdregistration_df.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [8]:
stdvle_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\studentVle.csv')
stdvle_df.head()

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

In [9]:
vle_df = pd.read_csv(r'C:\Users\SAMSUNG.LAPTOP-NJ45Q4AN\Desktop\Desafios\Trybe\anonymisedData\vle.csv')
vle_df.head()

   id_site code_module code_presentation activity_type  week_from  week_to
0   546943         AAA             2013J      resource        NaN      NaN
1   546712         AAA             2013J     oucontent        NaN      NaN
2   546998         AAA             2013J      resource        NaN      NaN
3   546888         AAA             2013J           url        NaN      NaN
4   547035         AAA             2013J      resource        NaN      NaN

In [20]:
stdinfo_df.head()
stdinfo_df.columns

Index(['code_module', 'code_presentation', 'id_student', 'gender', 'region',
       'highest_education', 'imd_band', 'age_band', 'num_of_prev_attempts',
       'studied_credits', 'disability', 'final_result'],
      dtype='object')

In [23]:
stdinfo_df.groupby('region')['id_student'].count()

region
East Anglian Region     3340
East Midlands Region    2365
Ireland                 1184
London Region           3216
North Region            1823
North Western Region    2906
Scotland                3446
South East Region       2111
South Region            3092
South West Region       2436
Wales                   2086
West Midlands Region    2582
Yorkshire Region        2006
Name: id_student, dtype: int64

In [22]:
stdinfo_df.groupby('gender')['id_student'].count()

gender
F    14718
M    17875
Name: id_student, dtype: int64

In [29]:
stdinfo_df.groupby('age_band')['id_student'].count()

age_band
0-35     22944
35-55     9433
55<=       216
Name: id_student, dtype: int64

In [31]:
stdinfo_df.groupby('highest_education')['id_student'].count()

highest_education
A Level or Equivalent          14045
HE Qualification                4730
Lower Than A Level             13158
No Formal quals                  347
Post Graduate Qualification      313
Name: id_student, dtype: int64

In [28]:
stdinfo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  int64
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              31482 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB